<a href="https://colab.research.google.com/github/devssom/data-analysis/blob/main/%ED%8C%90%EB%8B%A4%EC%8A%A4_%EA%B8%B0%EC%B4%88.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [12]:
!pip install pandas

Requirement already satisfied: pandas in /usr/local/lib/python3.7/dist-packages (1.1.5)
Requirement already satisfied: python-dateutil>=2.7.3 in /usr/local/lib/python3.7/dist-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2017.2 in /usr/local/lib/python3.7/dist-packages (from pandas) (2018.9)
Requirement already satisfied: numpy>=1.15.4 in /usr/local/lib/python3.7/dist-packages (from pandas) (1.19.5)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.7/dist-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)

# 1. 판다스 - 데이터 프레임
- 데이터프레임이 무엇인지
- 데이터프레임을 만드는 방법
- 데이터프레임을 파일로 읽는 방법
- 컬럼의 이해

## 1.1 데이터프레임 만들기
- DataFrame = 표, DataSet, Table
- 데이터프레임은 컬럼이 여러개 모여있는 표
- 이름과 순서를 가지고 데이터를 다룰 수 있음

In [13]:
import pandas

In [14]:
# 리스트로 데이터프레임 만들기

numbers = [
  [1, 2, 3, 4],
  [10, 20, 30, 40],
  [11, 12, 13, 14],
  [21, 22, 23, 24],
  [31, 32, 33, 34]
]

df = pandas.DataFrame(numbers, columns=['a', 'b', 'c', 'd'])
df

    a   b   c   d
0   1   2   3   4
1  10  20  30  40
2  11  12  13  14
3  21  22  23  24
4  31  32  33  34

In [15]:
# 딕셔너리로 데이터프레임 만들기

dic = {'이름' : ['강호동', '유병재', '김종민', '신동'],
       '점수' : [100, 90, 89, 95]}

df = pandas.DataFrame(dic)
df

    이름   점수
0  강호동  100
1  유병재   90
2  김종민   89
3   신동   95

## 1.2 CSV 파일에서 읽어오기
- read_csv 함수를 이용
- 내 컴퓨터(로컬) 내의 파일 뿐만 아니라, url을 이용해서 웹에서 직접 읽을 수도 있음

In [16]:
import pandas as pd

path = 'https://raw.githubusercontent.com/Jangrae/csv/master/titanic_simple.csv'

df = pd.read_csv(path)
df

     PassengerId  Survived  Pclass  ...   Age     Fare      Embarked
0              1         0       3  ...  22.0   7.2500  Southhampton
1              2         1       1  ...  38.0  71.2833     Cherbourg
2              3         1       3  ...  26.0   7.9250  Southhampton
3              4         1       1  ...  35.0  53.1000  Southhampton
4              5         0       3  ...  35.0   8.0500  Southhampton
..           ...       ...     ...  ...   ...      ...           ...
886          887         0       2  ...  27.0  13.0000  Southhampton
887          888         1       1  ...  19.0  30.0000  Southhampton
888          889         0       3  ...   NaN  23.4500  Southhampton
889          890         1       1  ...  26.0  30.0000     Cherbourg
890          891         0       3  ...  32.0   7.7500    Queenstown

[891 rows x 8 columns]

## 1.3 데이터프레임의 정보 확인
1. 데이터프레임(표)의 기본 정보 확인
2. 데이터 자체에 대한 파악
3. 데이터프레임 컬럼의 타입 조정

### 1.3.1 데이터프레임(표)의 기본 정보 확인
- shape: 전체 관측치의 개수, 칼럼의 개수
- info(): 각 칼럼에 대한 데이터 유형 확인
- columns : 컬럼명 확인 및 변경

In [17]:
# shape: (관측치 수, 컬럼 수)
print(df.shape)

(891, 8)

In [18]:
# 컬럼명을 리스트로 출력
print(df.columns)

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'Fare',
       'Embarked'],
      dtype='object')

- 딕셔너리처럼 컬럼명으로 각 컬럼별 데이터를 확인할 수 있음
  - 하지만, 컬럼을 가져온 것이기 때문에, 이 경우에는 표(데이터프레임)이 아님
  - pandas에서 컬럼은 Series

In [19]:
df['Survived']

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [20]:
# 컬럼의 이름들, null이 아닌 값들의 개수(결측치 여부), 데이터 타입의 정보
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   Fare         891 non-null    float64
 7   Embarked     889 non-null    object
dtypes: float64(2), int64(3), object(3)
memory usage: 55.8+ KB

## 1.3.2 데이터 파악하기
- head/tail : 데이터를 몇 개씩 보는 방법
- describe: 수치형 데이터의 통계량 확인
- value_counts: 범주형 데이터의 범주별 빈도수 확인

In [21]:
df.head(3)

   PassengerId  Survived  Pclass  ...   Age     Fare      Embarked
0            1         0       3  ...  22.0   7.2500  Southhampton
1            2         1       1  ...  38.0  71.2833     Cherbourg
2            3         1       3  ...  26.0   7.9250  Southhampton

[3 rows x 8 columns]

In [22]:
df.tail(3)

     PassengerId  Survived  Pclass  ...   Age   Fare      Embarked
888          889         0       3  ...   NaN  23.45  Southhampton
889          890         1       1  ...  26.0  30.00     Cherbourg
890          891         0       3  ...  32.0   7.75    Queenstown

[3 rows x 8 columns]

In [23]:
# 수치형 변수 -> 수치형 통계량 : 평균, 표준편차, 사분위수
df.describe()

       PassengerId    Survived      Pclass         Age        Fare
count   891.000000  891.000000  891.000000  714.000000  891.000000
mean    446.000000    0.383838    2.308642   29.699118   32.204208
std     257.353842    0.486592    0.836071   14.526497   49.693429
min       1.000000    0.000000    1.000000    0.420000    0.000000
25%     223.500000    0.000000    2.000000   20.125000    7.910400
50%     446.000000    0.000000    3.000000   28.000000   14.454200
75%     668.500000    1.000000    3.000000   38.000000   31.000000
max     891.000000    1.000000    3.000000   80.000000  512.329200

In [24]:
# 범주형 변수 -> 범주별 빈도수
print(df['Sex'].value_counts())
print(df['Embarked'].value_counts())

male      577
female    314
Name: Sex, dtype: int64
Southhampton    644
Cherbourg       168
Queenstown       77
Name: Embarked, dtype: int64

## 1.3.3 데이터프레임 타입 조정
- 각 컬럼의 타입이 범주형, 수치형으로 알맞게 적용되었는지 확인해야함
  - dtypes: 데이터 타입 확인
- 알맞지 않은 컬럼의 경우, 조정이 필요함
  - astype: 데이터 타입 변경
    - 범주형: category
    - 수치형: int, float

In [25]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
Fare           float64
Embarked        object
dtype: object

In [26]:
df['Survived'] = df['Survived'].astype('category')
df['Pclass'] = df['Pclass'].astype('category')
df['Sex'] = df['Sex'].astype('category')
df['Embarked'] = df['Embarked'].astype('category')
print(df.dtypes)

PassengerId       int64
Survived       category
Pclass         category
Name             object
Sex            category
Age             float64
Fare            float64
Embarked       category
dtype: object

In [27]:
df.describe()

       PassengerId         Age        Fare
count   891.000000  714.000000  891.000000
mean    446.000000   29.699118   32.204208
std     257.353842   14.526497   49.693429
min       1.000000    0.420000    0.000000
25%     223.500000   20.125000    7.910400
50%     446.000000   28.000000   14.454200
75%     668.500000   38.000000   31.000000
max     891.000000   80.000000  512.329200

In [28]:
# 범주형 변수 -> 범주별 빈도수
print('pclass ---')
print(df['Pclass'].value_counts())
print('survived ---')
print(df['Survived'].value_counts())
print('sex ---')
print(df['Sex'].value_counts())
print('embarked ---')
print(df['Embarked'].value_counts())

pclass ---
3    491
1    216
2    184
Name: Pclass, dtype: int64
survived ---
0    549
1    342
Name: Survived, dtype: int64
sex ---
male      577
female    314
Name: Sex, dtype: int64
embarked ---
Southhampton    644
Cherbourg       168
Queenstown       77
Name: Embarked, dtype: int64

## 1.3.4 데이터 정렬하기
- sort_index() 메소드 : 인덱스를 기준으로 정렬
- sort_values() 메소드 : **특정 컬럼**을 기준으로 정렬

In [29]:
# 오름차순 정렬
df.sort_index()

# 내림차순 정렬
df.sort_index(ascending=False)

     PassengerId Survived Pclass  ...   Age     Fare      Embarked
890          891        0      3  ...  32.0   7.7500    Queenstown
889          890        1      1  ...  26.0  30.0000     Cherbourg
888          889        0      3  ...   NaN  23.4500  Southhampton
887          888        1      1  ...  19.0  30.0000  Southhampton
886          887        0      2  ...  27.0  13.0000  Southhampton
..           ...      ...    ...  ...   ...      ...           ...
4              5        0      3  ...  35.0   8.0500  Southhampton
3              4        1      1  ...  35.0  53.1000  Southhampton
2              3        1      3  ...  26.0   7.9250  Southhampton
1              2        1      1  ...  38.0  71.2833     Cherbourg
0              1        0      3  ...  22.0   7.2500  Southhampton

[891 rows x 8 columns]

In [30]:
# Age의 값으로 정렬

df. sort_values('Age', ascending=False)

     PassengerId Survived Pclass  ...   Age     Fare      Embarked
630          631        1      1  ...  80.0  30.0000  Southhampton
851          852        0      3  ...  74.0   7.7750  Southhampton
493          494        0      1  ...  71.0  49.5042     Cherbourg
96            97        0      1  ...  71.0  34.6542     Cherbourg
116          117        0      3  ...  70.5   7.7500    Queenstown
..           ...      ...    ...  ...   ...      ...           ...
859          860        0      3  ...   NaN   7.2292     Cherbourg
863          864        0      3  ...   NaN  69.5500  Southhampton
868          869        0      3  ...   NaN   9.5000  Southhampton
878          879        0      3  ...   NaN   7.8958  Southhampton
888          889        0      3  ...   NaN  23.4500  Southhampton

[891 rows x 8 columns]

In [31]:
# Pclass, Age의 값으로 정렬

df.sort_values(['Pclass', 'Age'])

     PassengerId Survived Pclass  ...    Age      Fare      Embarked
305          306        1      1  ...   0.92  151.5500  Southhampton
297          298        0      1  ...   2.00  151.5500  Southhampton
445          446        1      1  ...   4.00   81.8583  Southhampton
802          803        1      1  ...  11.00  120.0000  Southhampton
435          436        1      1  ...  14.00  120.0000  Southhampton
..           ...      ...    ...  ...    ...       ...           ...
859          860        0      3  ...    NaN    7.2292     Cherbourg
863          864        0      3  ...    NaN   69.5500  Southhampton
868          869        0      3  ...    NaN    9.5000  Southhampton
878          879        0      3  ...    NaN    7.8958  Southhampton
888          889        0      3  ...    NaN   23.4500  Southhampton

[891 rows x 8 columns]



---
## 1.5 실습

In [32]:
import pandas as pd

path = 'https://raw.githubusercontent.com/blackdew/tensorflow1/master/csv/iris2.csv'
iris = pd.read_csv(path)
iris

     꽃잎길이  꽃잎폭  꽃받침길이  꽃받침폭  품종
0     5.1  3.5    1.4   0.2   0
1     4.9  3.0    1.4   0.2   0
2     4.7  3.2    1.3   0.2   0
3     4.6  3.1    1.5   0.2   0
4     5.0  3.6    1.4   0.2   0
..    ...  ...    ...   ...  ..
145   6.7  3.0    5.2   2.3   2
146   6.3  2.5    5.0   1.9   2
147   6.5  3.0    5.2   2.0   2
148   6.2  3.4    5.4   2.3   2
149   5.9  NaN    5.1   1.8   2

[150 rows x 5 columns]

In [33]:
iris.head()

   꽃잎길이  꽃잎폭  꽃받침길이  꽃받침폭  품종
0   5.1  3.5    1.4   0.2   0
1   4.9  3.0    1.4   0.2   0
2   4.7  3.2    1.3   0.2   0
3   4.6  3.1    1.5   0.2   0
4   5.0  3.6    1.4   0.2   0

In [34]:
print(iris.shape)

(150, 5)

In [35]:
iris.info

<bound method DataFrame.info of      꽃잎길이  꽃잎폭  꽃받침길이  꽃받침폭  품종
0     5.1  3.5    1.4   0.2   0
1     4.9  3.0    1.4   0.2   0
2     4.7  3.2    1.3   0.2   0
3     4.6  3.1    1.5   0.2   0
4     5.0  3.6    1.4   0.2   0
..    ...  ...    ...   ...  ..
145   6.7  3.0    5.2   2.3   2
146   6.3  2.5    5.0   1.9   2
147   6.5  3.0    5.2   2.0   2
148   6.2  3.4    5.4   2.3   2
149   5.9  NaN    5.1   1.8   2

[150 rows x 5 columns]>

In [36]:
iris['품종'].value_counts()

2    50
1    50
0    50
Name: 품종, dtype: int64

In [37]:
iris['품종'] = iris['품종'].astype('category')

In [38]:
iris.info

<bound method DataFrame.info of      꽃잎길이  꽃잎폭  꽃받침길이  꽃받침폭 품종
0     5.1  3.5    1.4   0.2  0
1     4.9  3.0    1.4   0.2  0
2     4.7  3.2    1.3   0.2  0
3     4.6  3.1    1.5   0.2  0
4     5.0  3.6    1.4   0.2  0
..    ...  ...    ...   ... ..
145   6.7  3.0    5.2   2.3  2
146   6.3  2.5    5.0   1.9  2
147   6.5  3.0    5.2   2.0  2
148   6.2  3.4    5.4   2.3  2
149   5.9  NaN    5.1   1.8  2

[150 rows x 5 columns]>

In [39]:
iris.dtypes

꽃잎길이      float64
꽃잎폭       float64
꽃받침길이     float64
꽃받침폭      float64
품종       category
dtype: object

In [40]:
iris.describe()

             꽃잎길이         꽃잎폭       꽃받침길이        꽃받침폭
count  150.000000  149.000000  150.000000  150.000000
mean     5.843333    3.054362    3.758667    1.198667
std      0.828066    0.435034    1.764420    0.763161
min      4.300000    2.000000    1.000000    0.100000
25%      5.100000    2.800000    1.600000    0.300000
50%      5.800000    3.000000    4.350000    1.300000
75%      6.400000    3.300000    5.100000    1.800000
max      7.900000    4.400000    6.900000    2.500000

# 2. 데이터 조회
- 특정 칼럼들만 선택하여 조회하는 방법
- 특정 행을 선택하여 조회하는 방법
- 특정 조건을 만족하는 데이터만 조회하는 방법

## 2.1 칼럼 선택

In [53]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'Fare',
       'Embarked'],
      dtype='object')

In [54]:
# 특정 칼럼 선택, 결과물은 Series
df['Survived'].head(3)

0    0
1    1
2    1
Name: Survived, dtype: category
Categories (2, int64): [0, 1]

In [56]:
# 이렇게 한번 더 괄호(리스트 형식)에 넣어주면, 그 컬럼만으로 데이터프레임을 새로 만들어줌
df[['Survived']].head(3)

  Survived
0        0
1        1
2        1

In [57]:
# 칼럼을 여러개 선택. 결과가 데이터프레임
columns = ['Survived', 'Pclass', 'Name']
df[columns].head(3)

  Survived Pclass                                               Name
0        0      3                            Braund, Mr. Owen Harris
1        1      1  Cumings, Mrs. John Bradley (Florence Briggs Th...
2        1      3                             Heikkinen, Miss. Laina

In [58]:
# 위와 동일한 코드. columns 변수를 이용하지 않지만,
df[['Survived', 'Pclass', 'Name']].head(3)

  Survived Pclass                                               Name
0        0      3                            Braund, Mr. Owen Harris
1        1      1  Cumings, Mrs. John Bradley (Florence Briggs Th...
2        1      3                             Heikkinen, Miss. Laina

## 2.2 행선택

In [59]:
# 행선택은 리스트 슬라이싱과 같은 방법. 인덱스가 아니고 순서.
df[:5]

   PassengerId Survived Pclass  ...   Age     Fare      Embarked
0            1        0      3  ...  22.0   7.2500  Southhampton
1            2        1      1  ...  38.0  71.2833     Cherbourg
2            3        1      3  ...  26.0   7.9250  Southhampton
3            4        1      1  ...  35.0  53.1000  Southhampton
4            5        0      3  ...  35.0   8.0500  Southhampton

[5 rows x 8 columns]

In [60]:
df.sort_values('Age', ascending=False)[:5]

     PassengerId Survived Pclass  ...   Age     Fare      Embarked
630          631        1      1  ...  80.0  30.0000  Southhampton
851          852        0      3  ...  74.0   7.7750  Southhampton
493          494        0      1  ...  71.0  49.5042     Cherbourg
96            97        0      1  ...  71.0  34.6542     Cherbourg
116          117        0      3  ...  70.5   7.7500    Queenstown

[5 rows x 8 columns]

## 2.4 실습
- 'titanic_simple.csv' 파일을 불러와 데이터프레임 **titanic**을 만드세요.
- 파일 경로: 'https://raw.githubusercontent.com/Jangrae/csv/master/titanic_simple.csv'

1. 데이터의 확인
  1. titanic 데이터프레임을 확인하고 설명해보세요.
  1. 상위 10개 행의 데이터를 조회하세요.
  1. 기초 통계 정보 확인
  1. 각 범주형 변수의 범주와 빈도수를 확인하세요. 
1. 데이터의 분리  
  1. 관측치 갯수를 7:3으로 분리해서 70%에 해당하는 관측치는 train, 30%에 해당하는 관측치는 test 변수에 담으세요. 
  1. Survived 칼럼만 갖는 데이터프레임을 만들어서 y_label이라는 변수에 담으세요. 
  1. Pclass, Sex, Age, Embarked 칼럼을 갖는 데이터프레임을 만들어 x_input 이라는 변수에 담으세요.

In [61]:
import pandas as pd

path = 'https://raw.githubusercontent.com/Jangrae/csv/master/titanic_simple.csv'
titanic = pd.read_csv(path)
print(titanic.shape)
titanic.info()
titanic.head(10)

(891, 8)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   Fare         891 non-null    float64
 7   Embarked     889 non-null    object
dtypes: float64(2), int64(3), object(3)
memory usage: 55.8+ KB

   PassengerId  Survived  Pclass  ...   Age     Fare      Embarked
0            1         0       3  ...  22.0   7.2500  Southhampton
1            2         1       1  ...  38.0  71.2833     Cherbourg
2            3         1       3  ...  26.0   7.9250  Southhampton
3            4         1       1  ...  35.0  53.1000  Southhampton
4            5         0       3  ...  35.0   8.0500  Southhampton
5            6         0       3  ...   NaN   8.4583    Queenstown
6            7         0       1  ...  54.0  51.8625  Southhampton
7            8         0       3  ...   2.0  21.0750  Southhampton
8            9         1       3  ...  27.0  11.1333  Southhampton
9           10         1       2  ...  14.0  30.0708     Cherbourg

[10 rows x 8 columns]

In [62]:
# 범주형 변수를 범주형 변수로 지정
titanic['Survived'] = titanic['Survived'].astype('category')
titanic['Pclass'] = titanic['Pclass'].astype('category')
titanic['Sex'] = titanic['Sex'].astype('category')
titanic['Embarked'] = titanic['Embarked'].astype('category')
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    category
 2   Pclass       891 non-null    category
 3   Name         891 non-null    object
 4   Sex          891 non-null    category
 5   Age          714 non-null    float64
 6   Fare         891 non-null    float64
 7   Embarked     889 non-null    category
dtypes: category(4), float64(2), int64(1), object(1)
memory usage: 31.8+ KB

In [63]:
# 범주형 변수 빈도 정보
print('pclass ----')
print(df['Pclass'].value_counts())
print('survived ----')
print(df['Survived'].value_counts())
print('sex ----')
print(df['Sex'].value_counts())
print('embarked ----')
print(df['Embarked'].value_counts())

# 수치형 변수 통계 정보
titanic.describe()

pclass ----
3    491
1    216
2    184
Name: Pclass, dtype: int64
survived ----
0    549
1    342
Name: Survived, dtype: int64
sex ----
male      577
female    314
Name: Sex, dtype: int64
embarked ----
Southhampton    644
Cherbourg       168
Queenstown       77
Name: Embarked, dtype: int64

       PassengerId         Age        Fare
count   891.000000  714.000000  891.000000
mean    446.000000   29.699118   32.204208
std     257.353842   14.526497   49.693429
min       1.000000    0.420000    0.000000
25%     223.500000   20.125000    7.910400
50%     446.000000   28.000000   14.454200
75%     668.500000   38.000000   31.000000
max     891.000000   80.000000  512.329200

In [64]:
# train/test 분리
num = int(891 * 0.7) # 70% 
train, test = titanic[:num], titanic[num:]
print(train.shape, test.shape)

(623, 8) (268, 8)

In [65]:
# x_input/y_label 분리
y_label = titanic[['Survived']]
x_input = titanic[['Pclass', 'Sex', 'Age', 'Embarked']]
print(x_input.shape, y_label.shape)

(891, 4) (891, 1)

# 3. 머신러닝을 위한 전처리 과정
- 데이터 분석, 머신러닝을 하기 위해 데이터를 준비하는 기본 과정
- 데이터 준비의 과정
  1. 결측치 처리
  1. 원핫인코딩 - 범주형 변수
  1. 정규화 - 수치형 변수
  1. train set, test set 분리 
  1. 독립변수와 종속변수 분리

## 3.0 데이터 확인 과정
사용 데이터: https://raw.githubusercontent.com/blackdew/tensorflow1/master/csv/iris2.csv

In [66]:
import pandas as pd

path = 'https://raw.githubusercontent.com/blackdew/tensorflow1/master/csv/iris2.csv'
iris = pd.read_csv(path)
iris.head()

   꽃잎길이  꽃잎폭  꽃받침길이  꽃받침폭  품종
0   5.1  3.5    1.4   0.2   0
1   4.9  3.0    1.4   0.2   0
2   4.7  3.2    1.3   0.2   0
3   4.6  3.1    1.5   0.2   0
4   5.0  3.6    1.4   0.2   0

In [67]:
print(iris.shape)
iris.info()

(150, 5)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   꽃잎길이    150 non-null    float64
 1   꽃잎폭     149 non-null    float64
 2   꽃받침길이   150 non-null    float64
 3   꽃받침폭    150 non-null    float64
 4   품종      150 non-null    int64
dtypes: float64(4), int64(1)
memory usage: 6.0 KB

In [68]:
iris['품종'].value_counts()

2    50
1    50
0    50
Name: 품종, dtype: int64

In [71]:
iris['품종'] = iris['품종'].astype('category')

In [70]:
iris.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   꽃잎길이    150 non-null    float64
 1   꽃잎폭     149 non-null    float64
 2   꽃받침길이   150 non-null    float64
 3   꽃받침폭    150 non-null    float64
 4   품종      150 non-null    category
dtypes: category(1), float64(4)
memory usage: 5.1 KB

In [72]:
iris.describe()

             꽃잎길이         꽃잎폭       꽃받침길이        꽃받침폭
count  150.000000  149.000000  150.000000  150.000000
mean     5.843333    3.054362    3.758667    1.198667
std      0.828066    0.435034    1.764420    0.763161
min      4.300000    2.000000    1.000000    0.100000
25%      5.100000    2.800000    1.600000    0.300000
50%      5.800000    3.000000    4.350000    1.300000
75%      6.400000    3.300000    5.100000    1.800000
max      7.900000    4.400000    6.900000    2.500000

## 3.1 결측치 처리
- isna() : 결측치 확인
- dropna() : 결측치가 있는 행/열 삭제
- fillna() : 결측치를 특정값으로 대치

In [74]:
# 특별코드 NA 데이터 찾기
iris[iris['꽃잎폭'].isna()]

     꽃잎길이  꽃잎폭  꽃받침길이  꽃받침폭 품종
149   5.9  NaN    5.1   1.8  2

In [75]:
iris.isna()  # 149번에 True 발견

      꽃잎길이    꽃잎폭  꽃받침길이   꽃받침폭     품종
0    False  False  False  False  False
1    False  False  False  False  False
2    False  False  False  False  False
3    False  False  False  False  False
4    False  False  False  False  False
..     ...    ...    ...    ...    ...
145  False  False  False  False  False
146  False  False  False  False  False
147  False  False  False  False  False
148  False  False  False  False  False
149  False   True  False  False  False

[150 rows x 5 columns]

In [42]:
iris.tail()

     꽃잎길이  꽃잎폭  꽃받침길이  꽃받침폭 품종
145   6.7  3.0    5.2   2.3  2
146   6.3  2.5    5.0   1.9  2
147   6.5  3.0    5.2   2.0  2
148   6.2  3.4    5.4   2.3  2
149   5.9  NaN    5.1   1.8  2

In [43]:
# 평균값으로 NaN을 채운 결과를 그대로 반환(원래 값은 바뀌지 않음)

mean = iris['꽃잎폭'].mean()
iris['꽃잎폭'] = iris['꽃잎폭'].fillna(mean) # 그래서 덮어씌워주는 것

In [44]:
iris.tail()

     꽃잎길이       꽃잎폭  꽃받침길이  꽃받침폭 품종
145   6.7  3.000000    5.2   2.3  2
146   6.3  2.500000    5.0   1.9  2
147   6.5  3.000000    5.2   2.0  2
148   6.2  3.400000    5.4   2.3  2
149   5.9  3.054362    5.1   1.8  2

## 3.2 원핫인코딩
- 범주형 변수를 모델에 넣기 위한 전처리를 할 때 사용
  - 모델에는 수치형 데이터만 넣을 수 있기 때문에 (머신러닝 모델 = 수학적인 함수) 숫자여야되는데, 범주형 데이터는 숫자가 아니니까 그걸 바꿔주는 것. 근데, 단순히 숫자로 바꾸면 되는게 아니라, 원핫인코딩으로 전처리를 해줘야 함.
- 각 범주들을 컬럼으로 만들고 0과 1의 값으로 변환
- get_dummis()

In [45]:
# 범주형 변수만 선택

category = iris[['품종']]
category.head()

  품종
0  0
1  0
2  0
3  0
4  0

In [46]:
# 원핫인코딩

encoded = pd.get_dummies(category)
encoded.head()

# 위에서 0~4까지 0이었는데, 그걸 품종_0이라는 컬럼으로 만들어서 1값을 넣어줬음
# 0과 1의 데이터로 각각의 컬럼값이 해석이 됨

   품종_0  품종_1  품종_2
0     1     0     0
1     1     0     0
2     1     0     0
3     1     0     0
4     1     0     0

In [47]:
encoded.tail()

     품종_0  품종_1  품종_2
145     0     0     1
146     0     0     1
147     0     0     1
148     0     0     1
149     0     0     1

In [76]:
df[['Survived', 'Pclass', 'Sex', 'Embarked']].head()

  Survived Pclass     Sex      Embarked
0        0      3    male  Southhampton
1        1      1  female     Cherbourg
2        1      3  female  Southhampton
3        1      1  female  Southhampton
4        0      3    male  Southhampton

In [77]:
pd.get_dummies(df[['Survived', 'Pclass', 'Sex', 'Embarked']]).head()

   Survived_0  Survived_1  ...  Embarked_Queenstown  Embarked_Southhampton
0           1           0  ...                    0                      1
1           0           1  ...                    0                      0
2           0           1  ...                    0                      1
3           0           1  ...                    0                      1
4           1           0  ...                    0                      1

[5 rows x 10 columns]

## 3.3 정규화
- 수치형 변수 컬럼 내 값들의 분포를 맞춰준다
- 최대최소 정규화(minmax normalize)
  - 최대값은 1로, 최소값은 0으로 바꿔주는 정규화
  - (X - minX) / (maxX - minX)
- 표준 정규화 (standardization)
  - 평균 0, 표준편차 1로 바꿔주는 정규화
  - (X - meanX) / stdX

In [48]:
iris.columns

Index(['꽃잎길이', '꽃잎폭', '꽃받침길이', '꽃받침폭', '품종'], dtype='object')

In [49]:
# 수치형 변수만 선택

numerical = iris[['꽃잎길이', '꽃잎폭', '꽃받침길이', '꽃받침폭']]
numerical.tail()

     꽃잎길이       꽃잎폭  꽃받침길이  꽃받침폭
145   6.7  3.000000    5.2   2.3
146   6.3  2.500000    5.0   1.9
147   6.5  3.000000    5.2   2.0
148   6.2  3.400000    5.4   2.3
149   5.9  3.054362    5.1   1.8

In [50]:
print(numerical.max())
print(numerical.min())

꽃잎길이     7.9
꽃잎폭      4.4
꽃받침길이    6.9
꽃받침폭     2.5
dtype: float64
꽃잎길이     4.3
꽃잎폭      2.0
꽃받침길이    1.0
꽃받침폭     0.1
dtype: float64

In [51]:
# minmax normalize

normalize = (numerical - numerical.min()) / (numerical.max() - numerical.min())
normalize  # 0과 1사이의 값으로 모두 바뀜

         꽃잎길이       꽃잎폭     꽃받침길이      꽃받침폭
0    0.222222  0.625000  0.067797  0.041667
1    0.166667  0.416667  0.067797  0.041667
2    0.111111  0.500000  0.050847  0.041667
3    0.083333  0.458333  0.084746  0.041667
4    0.194444  0.666667  0.067797  0.041667
..        ...       ...       ...       ...
145  0.666667  0.416667  0.711864  0.916667
146  0.555556  0.208333  0.677966  0.750000
147  0.611111  0.416667  0.711864  0.791667
148  0.527778  0.583333  0.745763  0.916667
149  0.444444  0.439318  0.694915  0.708333

[150 rows x 4 columns]

In [52]:
# standardization

normalize = (numerical - numerical.mean()) / numerical.std()
normalize

         꽃잎길이       꽃잎폭     꽃받침길이      꽃받침폭
0   -0.897674  1.027829 -1.336794 -1.308593
1   -1.139200 -0.125383 -1.336794 -1.308593
2   -1.380727  0.335902 -1.393470 -1.308593
3   -1.501490  0.105260 -1.280118 -1.308593
4   -1.018437  1.258472 -1.336794 -1.308593
..        ...       ...       ...       ...
145  1.034539 -0.125383  0.816888  1.443121
146  0.551486 -1.278595  0.703536  0.918985
147  0.793012 -0.125383  0.816888  1.050019
148  0.430722  0.797187  0.930239  1.443121
149  0.068433  0.000000  0.760212  0.787951

[150 rows x 4 columns]

In [78]:
numerical.isna().sum()

꽃잎길이     0
꽃잎폭      0
꽃받침길이    0
꽃받침폭     0
dtype: int64

In [83]:
# 개념 설명
df1 = pd.DataFrame([[1, 2, 3, 4, 5], 
                    [11, 12, 13, 14, 15]])
df1 = df1 + 10   
df1
# 각각 다 10 더해준 값으로 나옴

    0   1   2   3   4
0  11  12  13  14  15
1  21  22  23  24  25

In [95]:
# 개념 설명
df1 = pd.DataFrame([[1, 2, 3, 4, 5], 
                    [11, 12, 13, 14, 15]])
df2 = pd.Series([2, 3, 4, 5, 6])
df3 = df1 + df2
df3
# 마찬가지로 각각 행을 더해준 값으로 나옴

    0   1   2   3   4
0   3   5   7   9  11
1  13  15  17  19  21

In [87]:
numerical.head()

   꽃잎길이  꽃잎폭  꽃받침길이  꽃받침폭
0   5.1  3.5    1.4   0.2
1   4.9  3.0    1.4   0.2
2   4.7  3.2    1.3   0.2
3   4.6  3.1    1.5   0.2
4   5.0  3.6    1.4   0.2

In [80]:
numerical.min()

꽃잎길이     4.3
꽃잎폭      2.0
꽃받침길이    1.0
꽃받침폭     0.1
dtype: float64

In [81]:
numerical.max()

꽃잎길이     7.9
꽃잎폭      4.4
꽃받침길이    6.9
꽃받침폭     2.5
dtype: float64

In [94]:
# 꽃잎값에서 각각의 최소값들을 빼준 결과값

numerical - numerical.min()

     꽃잎길이       꽃잎폭  꽃받침길이  꽃받침폭
0     0.8  1.500000    0.4   0.1
1     0.6  1.000000    0.4   0.1
2     0.4  1.200000    0.3   0.1
3     0.3  1.100000    0.5   0.1
4     0.7  1.600000    0.4   0.1
..    ...       ...    ...   ...
145   2.4  1.000000    4.2   2.2
146   2.0  0.500000    4.0   1.8
147   2.2  1.000000    4.2   1.9
148   1.9  1.400000    4.4   2.2
149   1.6  1.054362    4.1   1.7

[150 rows x 4 columns]

In [89]:
# 꽃잎값의 최대값에서 각각의 최소값들을 빼준 결과값

numerical.max() - numerical.min()

꽃잎길이     3.6
꽃잎폭      2.4
꽃받침길이    5.9
꽃받침폭     2.4
dtype: float64

In [97]:
# 우리가 원하는 값은 결국
# min값은 0 ~ max값은 1, 나머지는 모두 0과 1 사이의 값으로 바뀌는 것

normalize = (numerical - numerical.min()) / (numerical.max() - numerical.min())
normalize

         꽃잎길이       꽃잎폭     꽃받침길이      꽃받침폭
0    0.222222  0.625000  0.067797  0.041667
1    0.166667  0.416667  0.067797  0.041667
2    0.111111  0.500000  0.050847  0.041667
3    0.083333  0.458333  0.084746  0.041667
4    0.194444  0.666667  0.067797  0.041667
..        ...       ...       ...       ...
145  0.666667  0.416667  0.711864  0.916667
146  0.555556  0.208333  0.677966  0.750000
147  0.611111  0.416667  0.711864  0.791667
148  0.527778  0.583333  0.745763  0.916667
149  0.444444  0.439318  0.694915  0.708333

[150 rows x 4 columns]

In [99]:
# 마찬가지로 표준정규화도 비슷 but, 값들의 평균이 0이고, 표준편차가 1인 값들로 표준화됨

normalize = (numerical - numerical.mean()) / numerical.std()
normalize

         꽃잎길이       꽃잎폭     꽃받침길이      꽃받침폭
0   -0.897674  1.027829 -1.336794 -1.308593
1   -1.139200 -0.125383 -1.336794 -1.308593
2   -1.380727  0.335902 -1.393470 -1.308593
3   -1.501490  0.105260 -1.280118 -1.308593
4   -1.018437  1.258472 -1.336794 -1.308593
..        ...       ...       ...       ...
145  1.034539 -0.125383  0.816888  1.443121
146  0.551486 -1.278595  0.703536  0.918985
147  0.793012 -0.125383  0.816888  1.050019
148  0.430722  0.797187  0.930239  1.443121
149  0.068433  0.000000  0.760212  0.787951

[150 rows x 4 columns]